app/controllers/api/videos_controller.rb

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @video = Video.find_by(id: params[:id])