app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "asdf"], ["LIMIT", 1]]
---
    def self.find_by_credentials(uname, pwd)
       user = User.find_by(username: uname )